Tekla Open API Reference for Tekla Structures 2025
FormingStates Constructor
 Initializes a new instance of the FormingStates class.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FormingStates()
Public Sub New
See Also
Reference
FormingStates Class
FormingStates Overload
Tekla.Structures.Forming Namespace